/*
MySQL Backup
Source Server Version: 5.5.60
Source Database: ordersys
Date: 2018/9/13 14:23:21
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
--  Table structure for `admin`
-- ----------------------------
DROP TABLE IF EXISTS `admin`;
CREATE TABLE `admin` (
  `account` varchar(10) NOT NULL,
  `password` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;

-- ----------------------------
--  Table structure for `bill`
-- ----------------------------
DROP TABLE IF EXISTS `bill`;
CREATE TABLE `bill` (
  `bill_number` int(10) NOT NULL AUTO_INCREMENT,
  `list` varchar(500) NOT NULL,
  `price` double(5,0) NOT NULL,
  `time` datetime NOT NULL,
  PRIMARY KEY (`bill_number`)
) ENGINE=InnoDB AUTO_INCREMENT=10029 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `dish`
-- ----------------------------
DROP TABLE IF EXISTS `dish`;
CREATE TABLE `dish` (
  `id` int(8) NOT NULL AUTO_INCREMENT,
  `name` varchar(8) NOT NULL,
  `price` double(5,0) NOT NULL,
  `time` varchar(5) NOT NULL,
  `image` varchar(200) NOT NULL,
  `type` varchar(10) NOT NULL,
  `description` varchar(50) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=27 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `staff`
-- ----------------------------
DROP TABLE IF EXISTS `staff`;
CREATE TABLE `staff` (
  `id` int(5) NOT NULL AUTO_INCREMENT,
  `name` varchar(10) NOT NULL,
  `cook` varchar(20) DEFAULT NULL,
  `permission` varchar(10) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=25 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `waiter`
-- ----------------------------
DROP TABLE IF EXISTS `waiter`;
CREATE TABLE `waiter` (
  `account` varchar(10) NOT NULL,
  `password` varchar(10) NOT NULL,
  `id` int(5) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
--  Records 
-- ----------------------------
INSERT INTO `admin` VALUES ('admin','123456');
INSERT INTO `bill` VALUES ('10001','[{\"dish_name\":\"藕粉丸子\",\"num\":\"2\"}]','100','2018-08-08 09:31:15'), ('10002','[{\"dish_name\":\"麻辣龙虾\",\"num\":\"1\"}]','120','2018-08-09 14:13:15'), ('10003','[{\"dish_name\":\"乌鸡炖蘑菇\",\"num\":\"1\"}]','80','2018-08-10 14:14:14'), ('10004','[{\"dish_name\":\"清蒸鲈鱼\",\"num\":\"1\"}]','65','2018-08-11 14:15:30'), ('10005','[{\"dish_name\":\"鱼香茄子\",\"num\":\"1\"}]','26','2018-08-12 14:19:05'), ('10006','[{\"dish_name\":\"麻辣龙虾\",\"num\":\"2\"}]','240','2018-08-13 16:27:33'), ('10007','[{\"dish_name\":\"蒜蓉虾\",\"num\":\"1\"}]','58','2018-08-14 16:28:28'), ('10008','[{\"dish_name\":\"清炒青菜\",\"num\":\"1\"}]','22','2018-08-15 16:29:48'), ('10009','[{\"dish_name\":\"酒酿元宵\",\"num\":\"3\"}]','108','2018-08-16 16:31:28'), ('10010','[{\"dish_name\":\"桂花糯米藕\",\"num\":\"2\"}]','60','2018-08-17 13:33:00'), ('10011','[{\"dish_name\":\"蒜蓉虾\",\"num\":\"1\"}]','58','2018-08-18 13:31:24'), ('10012','[{\"dish_name\":\"麻辣龙虾\",\"num\":\"1\"}]','120','2018-08-19 13:34:28'), ('10013','[{\"dish_name\":\"清蒸鲈鱼\",\"num\":\"1\"}]','65','2018-08-20 13:34:41'), ('10014','[{\"dish_name\":\"藕粉丸子\",\"num\":\"2\"}]','100','2018-08-21 00:00:00'), ('10015','[{\"dish_name\":\"鱼香茄子\",\"num\":\"1\"}]','26','2018-08-22 13:35:18'), ('10018','[{\"dish_id\":2,\"dish_name\":\"藕粉丸子\",\"num\":2}]','40','2018-09-11 14:47:55'), ('10019','[{\"dish_id\":15,\"dish_name\":\"蚂蚁上树\",\"num\":1}]','30','2018-09-11 17:01:21'), ('10020','[{\"dish_id\":2,\"dish_name\":\"藕粉丸子\",\"num\":1}]','39','2018-09-11 17:05:53'), ('10021','[{\"dish_id\":2,\"dish_name\":\"藕粉丸子\",\"num\":2}]','78','2018-09-11 19:04:26'), ('10022','[{\"dish_id\":2,\"dish_name\":\"藕粉丸子\",\"num\":1},{\"dish_id\":3,\"dish_name\":\"桂花糖糕\",\"num\":1}]','74','2018-09-11 22:51:15'), ('10023','[{\"dish_id\":2,\"dish_name\":\"藕粉丸子\",\"num\":1}]','39','2018-09-11 23:16:36'), ('10024','[{\"dish_id\":2,\"dish_name\":\"藕粉丸子\",\"num\":1}]','39','2018-09-11 23:24:52'), ('10025','[{\"dish_id\":2,\"dish_name\":\"藕粉丸子\",\"num\":1}]','39','2018-09-11 23:26:23'), ('10026','[{\"dish_id\":2,\"dish_name\":\"藕粉丸子\",\"num\":1},{\"dish_id\":3,\"dish_name\":\"桂花糖糕\",\"num\":1},{\"dish_id\":10,\"dish_name\":\"桂花糯米藕\",\"num\":1}]','104','2018-09-12 09:33:23'), ('10027','[{\"dish_id\":2,\"dish_name\":\"藕粉丸子\",\"num\":2},{\"dish_id\":3,\"dish_name\":\"桂花糖糕\",\"num\":1},{\"dish_id\":13,\"dish_name\":\"木耳炒蛋\",\"num\":1}]','139','2018-09-12 10:29:52'), ('10028','[{\"dish_id\":2,\"dish_name\":\"藕粉丸子\",\"num\":1},{\"dish_id\":3,\"dish_name\":\"桂花糖糕\",\"num\":1}]','74','2018-09-13 13:56:18');
INSERT INTO `dish` VALUES ('2','藕粉丸子','20','10','760766b021554c4f80beec7dadfd50d3_8df53df6905298225d3f0795d1ca7bcb0b46d4a.jpg','小吃','外层均匀圆滑，富有弹性，色泽透明而呈深咖啡色；馅心甜润爽口'), ('3','桂花糖糕','35','20','','小吃','凝结如胶，色如红玉可爱，加白糖霜掺食，大能营胃生津'), ('4','清蒸鲈鱼','65','40','','主食','鱼肉刚熟，细嫩爽滑，鱼肉的鲜美完全的呈现。汤汁带着米酒的甜，豉油的香，吃到嘴里绝对每一口都是享受\r\n'), ('5','麻辣龙虾','120','25','','主食','此菜色泽鲜亮，虾香浓郁，外壳酥脆，虾肉细嫩\r\n此菜色泽鲜亮，虾香浓郁，外壳酥脆，虾肉细嫩'), ('6','地三鲜','40','20','','主食','治胃癌 抗衰老 降低胆固醇保护心血管\r\n缓解疲劳\r\n解热、镇痛 增加食欲、帮助消化 净化血液\r\n治胃'), ('7','乌鸡炖蘑菇','80','35','','主食','明目\r\n降三高\r\n降血脂\r\n抗衰老\r\n安神\r\n补血\r\n防癌\r\n健脾\r\n明目\r\n明目\r\n'), ('8','蒜蓉虾','58','30','','主食','口味咸鲜，营养丰富\r\n'), ('9','鱼香茄子','26','30','','主食','保护心血管、抗坏血酸、防治胃癌、抗衰老\r\n'), ('10','桂花糯米藕','30','10','','小吃','色泽红亮，油润香甜。补中益气，健脾养胃，止虚汗之功效，对脾胃虚寒，食欲不佳，腹胀腹泻有一定缓解作用'), ('11','酒酿元宵','36','15','','小吃','团如玉粒，酒香四溢，风味独特，清甜爽口。乌发防止心脏病\r\n'), ('12','清炒青菜','22','20','','主食','促进大肠蠕动，增加大肠内毒素的排出，达到防癌抗癌的目的'), ('13','木耳炒蛋','26','25','','主食','补气血、减肥防癌治便秘、清肠胃\r\n'), ('15','蚂蚁上树','30','20','','主食','口味清淡，爽滑美味，色泽红亮。粉丝油亮，柔软滑嫩，面筋酥香，风味别致。'), ('25','小笼包','24','20','','小吃','皮薄卤足、鲜香美味\r\n'), ('26','啊实打','2333','233','','主食','高贵的233');
INSERT INTO `staff` VALUES ('3','王三','1','无'), ('4','韩寒','','无'), ('5','李为','1','无'), ('6','凌云','1','无'), ('7','何燕','','无'), ('8','年富','1/25','无'), ('9','嫣然','','无'), ('10','叶兴','','无'), ('11','姜顺','1','无'), ('12','安霖','1','无'), ('13','雷营','','无'), ('14','韩寒','1/2/3/4','无'), ('15','邢铭华','','无'), ('16','袁毅','1','无'), ('17','唐云','1/25','无'), ('18','龙创','1/8','无'), ('19','范进','','无'), ('20','赵芸','5','无'), ('23','王强强','1','无');
INSERT INTO `waiter` VALUES ('asd','123','4');
